app/controllers/admin/home_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "activity_logs".* FROM "activity_logs" ORDER BY "activity_logs"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" ORDER BY "cart_items"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "carts".* FROM "carts" ORDER BY "carts"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "wallets".* FROM "wallets" ORDER BY "wallets"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "users"
---
    def index
      # Fetch records for each model (table)
      @users = User.all
      @models = {
        "Action Text Rich Texts" => ActionText::RichText.all,
        "Active Storage Attachments" => ActiveStorage::Attachment.all,
        "Active Storage Blobs" => ActiveStorage::Blob.all,
        "Active Storage Variant Records" => ActiveStorage::VariantRecord.all,
        "Activity Logs" => ActivityLog.all,

        "Cart Items" => CartItem.all,
        "Carts" => Cart.all,

        "Comments" => Comment.all,
        "Order Items" => OrderItem.all,
        "Orders" => Order.all,
        "Products" => Product.all,

        "Wallets" => Wallet.all
      }

      # Get the count of users
      @user_count = User.count