app/views/activity_logs/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
---
      <tr>
        <td class="align-middle text-center"> <%= activity_log.user.email.split('@').first %> </td>