app/views/home/about.html.erb

            <% end %>
            <% if current_user.present? && (current_user.admin? || (product.present? && current_user == product.user)) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]