app/controllers/carts_controller.rb

    def new
        # if the user have one cart
        if current_user.cart.present?
            redirect_to cart_path(current_user.cart)
        else
            # make a new cart
            @cart = current_user.build_cart

            # if make correcly the cart
            if @cart.save
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["created_at", "2024-11-23 15:30:28.142517"], ["updated_at", "2024-11-23 15:30:28.142517"]]

    def add_to_cart

        @product = Product.find_by(id: params[:product_id])
        if current_user.id == @product.user_id
            flash[:error] = "You can not buy your own product"
            redirect_to root_path
            return
        end

        if @product
            @cart = current_user.cart || current_user.build_cart
            cart_item = @cart.cart_items.find_or_initialize_by( product: @product )
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "e836a8ea-6831-42b2-ab70-9db8e26bc049"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]

    def show
        @cart = current_user.cart || current_user.build_cart
        @product = Product.find_by(id: params[:product_id])
        @cart_items = @cart.cart_items

        if @cart.cart_items.empty?
---
SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]