app/controllers/home_controller.rb

    def about


        @products = Product.all
---
SELECT "products".* FROM "products"