app/models/user.rb

INSERT INTO "wallets" ("balance", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["balance", "0.0"], ["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["created_at", "2024-11-23 11:43:07.841394"], ["updated_at", "2024-11-23 11:43:07.841394"]]
---
         def create_wallet_on_user
          Wallet.create(user: self, balance: 0.00)